app/Controllers/Buku.php

    public function index()
    {
        $keyword = $this->request->getGet('keyword');
        $kategori = $this->request->getGet('kategori');

        $builder = $this->bukuModel
            ->select('buku.*, kategori.nama_kategori, penulis.nama_penulis, penerbit.nama_penerbit, rak.nama_rak, rak.lokasi')
            ->join('kategori', 'kategori.id_kategori = buku.id_kategori', 'left')
            ->join('penulis', 'penulis.id_penulis = buku.id_penulis', 'left')
            ->join('penerbit', 'penerbit.id_penerbit = buku.id_penerbit', 'left')
            ->join('buku_rak', 'buku_rak.id_buku = buku.id_buku', 'left')
            ->join('rak', 'rak.id_rak = buku_rak.id_rak', 'left');

        // FILTER JUDUL
        if ($keyword) {
            $builder->like('buku.judul', $keyword);
        }

        // FILTER KATEGORI
        if ($kategori) {
            $builder->where('buku.id_kategori', $kategori);
        }

        $data['buku'] = $builder->paginate(10);
        $data['pager'] = $this->bukuModel->pager;

        // kirim data kategori ke view
        $kategoriModel = new \App\Models\KategoriModel();
        $data['kategori'] = $kategoriModel->findAll();
---
SELECT COUNT(*) AS `numrows`
FROM `buku`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `buku`.`id_kategori`
LEFT JOIN `penulis` ON `penulis`.`id_penulis` = `buku`.`id_penulis`
LEFT JOIN `penerbit` ON `penerbit`.`id_penerbit` = `buku`.`id_penerbit`
LEFT JOIN `buku_rak` ON `buku_rak`.`id_buku` = `buku`.`id_buku`
LEFT JOIN `rak` ON `rak`.`id_rak` = `buku_rak`.`id_rak`
SELECT `buku`.*, `kategori`.`nama_kategori`, `penulis`.`nama_penulis`, `penerbit`.`nama_penerbit`, `rak`.`nama_rak`, `rak`.`lokasi`
FROM `buku`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `buku`.`id_kategori`
LEFT JOIN `penulis` ON `penulis`.`id_penulis` = `buku`.`id_penulis`
LEFT JOIN `penerbit` ON `penerbit`.`id_penerbit` = `buku`.`id_penerbit`
LEFT JOIN `buku_rak` ON `buku_rak`.`id_buku` = `buku`.`id_buku`
LEFT JOIN `rak` ON `rak`.`id_rak` = `buku_rak`.`id_rak`
 LIMIT 10
SELECT *
FROM `kategori`

    public function store()
    {
        $kategoriModel = new KategoriModel();
        $penulisModel = new PenulisModel();
        $penerbitModel = new PenerbitModel();
        $bukuRakModel = new \App\Models\BukuRakModel();

        // kategori
        $id_kategori = $this->request->getPost('id_kategori');
        if ($this->request->getPost('kategori_baru')) {
            $id_kategori = $kategoriModel->insert([
                'nama_kategori' => $this->request->getPost('kategori_baru')
            ]);
        }

        // penulis
        $id_penulis = $this->request->getPost('id_penulis');
        if ($this->request->getPost('penulis_baru')) {
            $id_penulis = $penulisModel->insert([
                'nama_penulis' => $this->request->getPost('penulis_baru')
            ]);
        }

        // penerbit
        $id_penerbit = $this->request->getPost('id_penerbit');
        if ($this->request->getPost('penerbit_baru')) {
            $id_penerbit = $penerbitModel->insert([
                'nama_penerbit' => $this->request->getPost('penerbit_baru')
            ]);
---
INSERT INTO `penulis` (`nama_penulis`) VALUES ('Dr. Saripuddin, M.Pd.I.')
INSERT INTO `penerbit` (`nama_penerbit`) VALUES ('PT Media Penerbit Indonesia')

        if ($judul != '') {

            // simpan buku
            $id_buku = $this->bukuModel->insert([
                'judul' => $judul,
                'isbn' => $this->request->getPost('isbn'),
                'id_kategori' => $id_kategori,
                'id_penulis' => $id_penulis,
                'id_penerbit' => $id_penerbit,
                'tahun_terbit' => $this->request->getPost('tahun_terbit'),
                'jumlah' => $this->request->getPost('jumlah'),
                'tersedia' => $this->request->getPost('jumlah'),
                'deskripsi' => $this->request->getPost('deskripsi'),
                'cover' => $namaCover
            ]);

            // simpan ke buku_rak
            if ($id_rak) {
                $bukuRakModel->insert([
                    'id_buku' => $id_buku,
                    'id_rak' => $id_rak
                ]);
---
INSERT INTO `buku` (`judul`, `isbn`, `id_kategori`, `id_penulis`, `id_penerbit`, `tahun_terbit`, `jumlah`, `tersedia`, `deskripsi`, `cover`) VALUES ('Manajemen Pendidikan', '9786238649372', '2', 17, 17, '2015', '6', '6', 'Di era globalisasi dan revolusi industri 4.0, dunia pendidikan menghadapi berbagai tantangan yang kompleks dan dinamis. “Manajemen Pendidikan: Strategi Modern untuk Kepemimpinan Efektif” merupakan buku referensi yang esensial, dirancang untuk membekali para pendidik, pemimpin pendidikan, dan para stakeholder terkait dengan wawasan serta alat-alat praktis untuk mengatasi tantangan tersebut.', '1776788629_65fe89a3b40a2fcf9249.jpeg')
INSERT INTO `buku_rak` (`id_buku`, `id_rak`) VALUES (49, '3')

    public function edit($id)
    {
        $kategoriModel = new \App\Models\KategoriModel();
        $penulisModel = new \App\Models\PenulisModel();
        $penerbitModel = new \App\Models\PenerbitModel();
        $rakModel = new \App\Models\RakModel();

        $data = [
            'buku' => $this->bukuModel->find($id),
            'kategori' => $kategoriModel->findAll(),
            'penulis' => $penulisModel->findAll(),
            'penerbit' => $penerbitModel->findAll(),
---
SELECT *
FROM `kategori`
SELECT *
FROM `penulis`
SELECT *
FROM `penerbit`