app/Controllers/Home.php

    public function index()
{
    $peminjamanModel = new PeminjamanModel();
    $pengembalianModel = new PengembalianModel();
    $bukuModel = new BukuModel();
    $usersModel = new UsersModel();

    // =========================
    // STATISTIK UTAMA
    // =========================
    $dipinjam = $peminjamanModel->countAll();
    $dikembalikan = $pengembalianModel->countAll();
    $sisa = $dipinjam - $dikembalikan;

    $total_buku = $bukuModel->countAll();
    $total_user = $usersModel->countAll();

    $aktif = $peminjamanModel
        ->where('status', 'dipinjam')
        ->countAllResults();
---
SELECT COUNT(*) AS `numrows` FROM `peminjaman`
SELECT COUNT(*) AS `numrows` FROM `pengembalian`
SELECT COUNT(*) AS `numrows` FROM `buku`
SELECT COUNT(*) AS `numrows` FROM `users`
SELECT COUNT(*) AS `numrows`
FROM `peminjaman`
WHERE `status` = 'dipinjam'