app/Controllers/Kategori.php

SELECT *
FROM `kategori`
---
   public function index()
{
    $keyword = $this->request->getGet('keyword');

    if ($keyword) {
        $data['kategori'] = $this->model
            ->like('nama_kategori', $keyword)
            ->findAll();
    } else {
        $data['kategori'] = $this->model->findAll();