app/Controllers/Peminjaman.php

 public function index()
{
    $role = session()->get('role');
    $id   = session()->get('id');

    $query = $this->peminjaman
        ->select('
            peminjaman.*,
            anggota.nama as nama_anggota,
            petugas.nama as nama_petugas
        ')
        ->join('users as anggota', 'anggota.id = peminjaman.id_anggota', 'left')
        ->join('users as petugas', 'petugas.id = peminjaman.id_petugas', 'left')
        ->orderBy('peminjaman.id_peminjaman', 'DESC');

    if ($role == 'anggota') {
        $query->where('peminjaman.id_anggota', $id);
    }

    $data['peminjaman'] = $query->findAll();

    $transaksiModel = new \App\Models\TransaksiModel();

foreach ($data['peminjaman'] as &$p) {

    $trx = $transaksiModel
        ->where('id_peminjaman', $p['id_peminjaman'])
        ->first();
---
SELECT `peminjaman`.*, `anggota`.`nama` as `nama_anggota`, `petugas`.`nama` as `nama_petugas`
FROM `peminjaman`
LEFT JOIN `users` as `anggota` ON `anggota`.`id` = `peminjaman`.`id_anggota`
LEFT JOIN `users` as `petugas` ON `petugas`.`id` = `peminjaman`.`id_petugas`
WHERE `peminjaman`.`id_anggota` = '20'
ORDER BY `peminjaman`.`id_peminjaman` DESC
SELECT `peminjaman`.*, `anggota`.`nama` as `nama_anggota`, `petugas`.`nama` as `nama_petugas`
FROM `peminjaman`
LEFT JOIN `users` as `anggota` ON `anggota`.`id` = `peminjaman`.`id_anggota`
LEFT JOIN `users` as `petugas` ON `petugas`.`id` = `peminjaman`.`id_petugas`
WHERE `peminjaman`.`id_anggota` = '25'
ORDER BY `peminjaman`.`id_peminjaman` DESC
SELECT *
FROM `transaksi`
WHERE `id_peminjaman` = '342'
 LIMIT 1

    public function store()
{
    $peminjamanModel = new \App\Models\PeminjamanModel();
    $detailModel     = new \App\Models\DetailPeminjamanModel();
    $bukuModel       = new \App\Models\BukuModel();
    $anggotaModel    = new \App\Models\AnggotaModel();
    $pengirimanModel = new \App\Models\PengirimanModel();
    $transaksiModel  = new \App\Models\TransaksiModel();

    $userId = session()->get('id');

    // ======================
    // CEK ANGGOTA
    // ======================
    $anggota = $anggotaModel->where('user_id', $userId)->first();
---
SELECT *
FROM `anggota`
WHERE `user_id` = '20'
 LIMIT 1

    $status = 'dipinjam';
}

$id_peminjaman = $peminjamanModel->insert([
    'id_anggota' => $userId,
    'id_petugas' => null,
    'tanggal_pinjam' => date('Y-m-d'),
    'tanggal_kembali' => date('Y-m-d', strtotime('+7 days')),
    'status' => $status,
    'metode' => $metode,
    'alamat' => ($metode == 'antar') ? $anggota['alamat'] : null
]);
---
INSERT INTO `peminjaman` (`id_anggota`, `id_petugas`, `tanggal_pinjam`, `tanggal_kembali`, `status`, `metode`, `alamat`) VALUES ('25', NULL, '2026-04-26', '2026-05-03', 'dipinjam', 'ambil', NULL)


        $biaya = 10000;

        $pengirimanModel->insert([
            'id_peminjaman' => $id_peminjaman,
            'alamat' => $anggota['alamat'],
            'biaya' => $biaya,
            'status' => 'menunggu'
        ]);

        $transaksiModel->insert([
            'id_peminjaman' => $id_peminjaman,
            'jenis' => 'pengiriman',
            'jumlah' => $biaya,

            // 🔥 FIX: konsisten pembayaran
            'status' => 'belum_bayar'
        ]);
---
INSERT INTO `pengiriman` (`id_peminjaman`, `alamat`, `biaya`, `status`, `petugas_id`) VALUES (266, 'sumedang', 10000, 'status', NULL)
INSERT INTO `transaksi` (`id_peminjaman`, `jenis`, `jumlah`, `status`) VALUES (266, 'pengiriman', 10000, 'belum_bayar')


        $jumlah = $jumlah_list[$key] ?? 1;

        $buku = $bukuModel->find($id_buku);
---
SELECT *
FROM `buku`
WHERE `buku`.`id_buku` = '41'

            'jumlah' => $jumlah
        ]);

        $bukuModel->update($id_buku, [
            'tersedia' => $buku['tersedia'] - $jumlah
        ]);
---
UPDATE `buku` SET `tersedia` = 1
WHERE `buku`.`id_buku` IN ('41')

    public function kembali($id)
{
    $model = new \App\Models\PeminjamanModel();

    $p = $model->find($id);

    if (!$p) {
        return redirect()->back()->with('error', 'Data tidak ditemukan');
    }

    // anggota request pengembalian
    if (session()->get('role') == 'anggota') {

        $model->update($id, [
            'status' => 'menunggu_pengembalian'
        ]);
---
UPDATE `peminjaman` SET `status` = 'dikembalikan', `tanggal_kembali` = '2026-04-26'
WHERE `peminjaman`.`id_peminjaman` IN ('288')