app/Controllers/Peminjaman.php

    public function create()
{
    $usersModel = new UsersModel();
    $bukuModel = new BukuModel();

    $data = [
        'petugas' => $usersModel->where('role', 'petugas')->findAll(),
        'anggota' => $usersModel->where('role', 'anggota')->findAll(),
        'buku'    => $bukuModel->findAll(),
---
SELECT *
FROM `users`
WHERE `role` = 'anggota'
SELECT *
FROM `buku`

public function store()
{
    $peminjamanModel = new \App\Models\PeminjamanModel();
    $detailModel     = new \App\Models\DetailPeminjamanModel();
    $bukuModel       = new \App\Models\BukuModel();
    $anggotaModel    = new \App\Models\AnggotaModel();
    $pengirimanModel = new \App\Models\PengirimanModel();

    // ======================
    // USER LOGIN
    // ======================
    $userId = session()->get('id');

    // ======================
    // AMBIL DATA ANGGOTA
    // ======================
    $anggota = $anggotaModel->where('user_id', $userId)->first();
---
SELECT *
FROM `anggota`
WHERE `user_id` = '15'
 LIMIT 1


    // ======================
    // SIMPAN PEMINJAMAN
    // ======================
    $id_peminjaman = $peminjamanModel->insert([
        'id_anggota' => $userId,
        'id_petugas' => null,
        'tanggal_pinjam' => date('Y-m-d'),
        'tanggal_kembali' => date('Y-m-d', strtotime('+7 days')),
        'status' => ($metode == 'antar') ? 'diproses' : 'dipinjam',

        // 🔥 PENTING UNTUK PENARIKAN
        'metode' => $metode,
        'alamat' => ($metode == 'antar') ? $anggota['alamat'] : null
    ]);
---
INSERT INTO `peminjaman` (`id_anggota`, `id_petugas`, `tanggal_pinjam`, `tanggal_kembali`, `status`, `alamat`) VALUES ('15', NULL, '2026-04-21', '2026-04-28', 'dipinjam', NULL)


        $jumlah = $jumlah_list[$key] ?? 1;

        $buku = $bukuModel->find($id_buku);
---
SELECT *
FROM `buku`
WHERE `buku`.`id_buku` = '49'

            'jumlah' => $jumlah
        ]);

        $bukuModel->update($id_buku, [
            'tersedia' => $buku['tersedia'] - $jumlah
        ]);
---
UPDATE `buku` SET `tersedia` = 1
WHERE `buku`.`id_buku` IN ('49')