app/Controllers/Pengiriman.php

SELECT `pengiriman`.*, `peminjaman`.`id_anggota`
FROM `pengiriman`
JOIN `peminjaman` ON `peminjaman`.`id_peminjaman` = `pengiriman`.`id_peminjaman`
---
    public function index()
    {
        $model = new PengirimanModel();

        $data['pengiriman'] = $model
            ->select('pengiriman.*, peminjaman.id_anggota')
            ->join('peminjaman', 'peminjaman.id_peminjaman = pengiriman.id_peminjaman')
            ->findAll();

UPDATE `pengiriman` SET `status` = 'selesai'
WHERE `pengiriman`.`id_pengiriman` IN ('39')
UPDATE `peminjaman` SET `status` = 'dipinjam'
WHERE `peminjaman`.`id_peminjaman` IN ('89')
---
    public function sampai($id)
    {
        $pengirimanModel = new \App\Models\PengirimanModel();
        $peminjamanModel = new \App\Models\PeminjamanModel();

        // ambil data pengiriman
        $pengiriman = $pengirimanModel->find($id);

        if (!$pengiriman) {
            return redirect()->back()->with('error', 'Data tidak ditemukan');
        }

        // update pengiriman
        $pengirimanModel->update($id, [
            'status' => 'selesai'
        ]);

        // sinkron ke peminjaman
        $peminjamanModel->update($pengiriman['id_peminjaman'], [
            'status' => 'dipinjam'
        ]);