app/Controllers/Transaksi.php

    public function index()
    {
        $model = new TransaksiModel();

        $data['transaksi'] = $model
            ->orderBy('id_transaksi', 'DESC')
            ->findAll();
---
SELECT *
FROM `transaksi`
ORDER BY `id_transaksi` DESC