app/Views/layouts/menu.php

SELECT COUNT(*) AS `numrows`
FROM `transaksi`
WHERE `jenis` = 'denda'
AND `status` = 'menunggu_verifikasi'
---

        <?php
        $db = \Config\Database::connect();
        $notifDendaCount = $db->table('transaksi')
            ->where('jenis', 'denda')
            ->where('status', 'menunggu_verifikasi')
            ->countAllResults();